Tekla Open API Reference for Tekla Structures 2025
WpfOkApplyModifyGetOnOffCancel Class
 Interaction logic for WpfOkApplyModifyGetOnOffCancel.xaml
 WpfOkApplyModifyGetOnOffCancel
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfOkApplyModifyGetOnOffCancel
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfOkApplyModifyGetOnOffCancel : UserControl,
	IComponentConnector
Public Class WpfOkApplyModifyGetOnOffCancel
	Inherits UserControl
	Implements IComponentConnector
The WpfOkApplyModifyGetOnOffCancel type exposes the following members.
Constructors
Name | Description
WpfOkApplyModifyGetOnOffCancel
 Constructor
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
Events
Name | Description
ApplyClicked
 The ApplyClicked event is raised when the Apply button is clicked.
CancelClicked
 The CancelClicked event is raised when the Cancel button is clicked.
GetClicked
 The GetClicked event is raised when the Get button is clicked.
ModifyClicked
 The ModifyClicked event is raised when the Modify button is clicked.
OkClicked
 The OkClicked event is raised when the Ok button is clicked.
OnOffClicked
 The OnOffClicked event is raised when the OnOff button is clicked.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace